---
kind: type
id: T:Autodesk.Revit.DB.Structure.AreaReinforcementType
source: html/1fb9f43b-e9d7-89b9-104f-2dd57e84fbe2.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcementType

An object that specifies the type of a Structural Area Reinforcement element in Autodesk Revit.

## Syntax (C#)
```csharp
public class AreaReinforcementType : ElementType
```

## Remarks
The clear cover settings can be accessed via this object.